rashiqul/S32K1X_Workspace/src/bsp/platform_sdk/RTD/BaseNXP_TS_T40D2M30I0R0/header/S32M24x_DMA.h
/*
** ###################################################################
**     Processor:           S32M24x
**     Compiler:            Keil ARM C/C++ Compiler
**     Reference manual:    S32M24x RM Rev.4
**     Version:             rev. 1.5, 2024-08-01
**     Build:               b240801
**
**     Abstract:
**         Peripheral Access Layer for S32M24x
**
**     Copyright 1997-2016 Freescale Semiconductor, Inc.
**     Copyright 2016-2024 NXP
**
**     NXP Confidential and Proprietary. This software is owned or controlled
**     by NXP and may only be used strictly in accordance with the applicable
**     license terms. By expressly accepting such terms or by downloading,
**     installing, activating and/or otherwise using the software, you are
**     agreeing that you have read, and that you agree to comply with and are
**     bound by, such license terms. If you do not agree to be bound by the
**     applicable license terms, then you may not retain, install, activate
**     or otherwise use the software.
**
**     http:                 www.nxp.com
**     mail:                 support@nxp.com
**
** ###################################################################
*/

/*!
 * @file S32M24x_DMA.h
 * @version 1.5
 * @date 2024-08-01
 * @brief Peripheral Access Layer for S32M24x_DMA
 *
 * This file contains register definitions and macros for easy access to their
 * bit fields.
 *
 * This file assumes LITTLE endian system.
 */

/**
 * @page misra_violations MISRA-C:2012 violations
 *
 * @section [global]
 * Violates MISRA 2012 Advisory Rule 2.3, local typedef not referenced
 * The SoC header defines typedef for all modules.
 *
 * @section [global]
 * Violates MISRA 2012 Advisory Rule 2.5, local macro not referenced
 * The SoC header defines macros for all modules and registers.
 *
 * @section [global]
 * Violates MISRA 2012 Advisory Directive 4.9, Function-like macro
 * These are generated macros used for accessing the bit-fields from registers.
 *
 * @section [global]
 * Violates MISRA 2012 Required Rule 5.1, identifier clash
 * The supported compilers use more than 31 significant characters for identifiers.
 *
 * @section [global]
 * Violates MISRA 2012 Required Rule 5.2, identifier clash
 * The supported compilers use more than 31 significant characters for identifiers.
 *
 * @section [global]
 * Violates MISRA 2012 Required Rule 5.4, identifier clash
 * The supported compilers use more than 31 significant characters for identifiers.
 *
 * @section [global]
 * Violates MISRA 2012 Required Rule 5.5, identifier clash
 * The supported compilers use more than 31 significant characters for identifiers.
 *
 * @section [global]
 * Violates MISRA 2012 Required Rule 21.1, defined macro '__I' is reserved to the compiler
 * This type qualifier is needed to ensure correct I/O access and addressing.
 */

/* Prevention from multiple including the same memory map */
#if !defined(S32M24x_DMA_H_) /* Check if memory map has not been already included */
#define S32M24x_DMA_H_

#include "S32M24x_COMMON.h"

/* ----------------------------------------------------------------------------
   -- DMA Peripheral Access Layer
   ---------------------------------------------------------------------------- */

/*!
 * @addtogroup DMA_Peripheral_Access_Layer DMA Peripheral Access Layer
 * @{
 */

/** DMA - Size of Registers Arrays */
#define DMA_DCHPRI_COUNT 16u
#define DMA_TCD_COUNT 16u

/** DMA - Register Layout Typedef */
typedef struct {
    __IO uint32_t CR; /**< Control, offset: 0x0 */
    __I uint32_t ES;  /**< Error Status, offset: 0x4 */
    uint8_t RESERVED_0[4];
    __IO uint32_t ERQ; /**< Enable Request, offset: 0xC */
    uint8_t RESERVED_1[4];
    __IO uint32_t EEI; /**< Enable Error Interrupt, offset: 0x14 */
    __O uint8_t CEEI;  /**< Clear Enable Error Interrupt, offset: 0x18 */
    __O uint8_t SEEI;  /**< Set Enable Error Interrupt, offset: 0x19 */
    __O uint8_t CERQ;  /**< Clear Enable Request, offset: 0x1A */
    __O uint8_t SERQ;  /**< Set Enable Request, offset: 0x1B */
    __O uint8_t CDNE;  /**< Clear DONE Status Bit, offset: 0x1C */
    __O uint8_t SSRT;  /**< Set START Bit, offset: 0x1D */
    __O uint8_t CERR;  /**< Clear Error, offset: 0x1E */
    __O uint8_t CINT;  /**< Clear Interrupt Request, offset: 0x1F */
    uint8_t RESERVED_2[4];
    __IO uint32_t INT; /**< Interrupt Request, offset: 0x24 */
    uint8_t RESERVED_3[4];
    __IO uint32_t ERR; /**< Error, offset: 0x2C */
    uint8_t RESERVED_4[4];
    __I uint32_t HRS; /**< Hardware Request Status, offset: 0x34 */
    uint8_t RESERVED_5[12];
    __IO uint32_t EARS; /**< Enable Asynchronous Request in Stop, offset: 0x44 */
    uint8_t RESERVED_6[184];
    __IO uint8_t
        DCHPRI[DMA_DCHPRI_COUNT]; /**< Channel Priority, array offset: 0x100, array step: 0x1 */
    uint8_t RESERVED_7[3824];
    struct DMA_TCD {         /* offset: 0x1000, array step: 0x20 */
        __IO uint32_t SADDR; /**< TCD Source Address, array offset: 0x1000, array step: 0x20 */
        __IO uint16_t
            SOFF; /**< TCD Signed Source Address Offset, array offset: 0x1004, array step: 0x20 */
        __IO uint16_t ATTR; /**< TCD Transfer Attributes, array offset: 0x1006, array step: 0x20 */
        union {             /* offset: 0x1008, array step: 0x20 */
            __IO uint32_t MLNO;    /**< TCD Minor Byte Count (Minor Loop Mapping Disabled), array
                                      offset: 0x1008, array step: 0x20 */
            __IO uint32_t MLOFFNO; /**< TCD Signed Minor Loop Offset (Minor Loop Mapping Enabled and
                                      Offset Disabled), array offset: 0x1008, array step: 0x20 */
            __IO uint32_t MLOFFYES; /**< TCD Signed Minor Loop Offset (Minor Loop Mapping and Offset
                                       Enabled), array offset: 0x1008, array step: 0x20 */
        } NBYTES;
        __IO uint32_t SLAST; /**< TCD Last Source Address Adjustment, array offset: 0x100C, array
                                step: 0x20 */
        __IO uint32_t DADDR; /**< TCD Destination Address, array offset: 0x1010, array step: 0x20 */
        __IO uint16_t DOFF;  /**< TCD Signed Destination Address Offset, array offset: 0x1014, array
                                step: 0x20 */
        union {              /* offset: 0x1016, array step: 0x20 */
            __IO uint16_t ELINKNO;  /**< TCD Current Minor Loop Link, Major Loop Count (Channel
                                       Linking Disabled), array offset: 0x1016, array step: 0x20 */
            __IO uint16_t ELINKYES; /**< TCD Current Minor Loop Link, Major Loop Count (Channel
                                       Linking Enabled), array offset: 0x1016, array step: 0x20 */
        } CITER;
        __IO uint32_t DLASTSGA; /**< TCD Last Destination Address Adjustment/Scatter Gather Address,
                                   array offset: 0x1018, array step: 0x20 */
        __IO uint16_t CSR; /**< TCD Control and Status, array offset: 0x101C, array step: 0x20 */
        union {            /* offset: 0x101E, array step: 0x20 */
            __IO uint16_t ELINKNO;  /**< TCD Beginning Minor Loop Link, Major Loop Count (Channel
                                       Linking Disabled), array offset: 0x101E, array step: 0x20 */
            __IO uint16_t ELINKYES; /**< TCD Beginning Minor Loop Link, Major Loop Count (Channel
                                       Linking Enabled), array offset: 0x101E, array step: 0x20 */
        } BITER;
    } TCD[DMA_TCD_COUNT];
} DMA_Type, *DMA_MemMapPtr;

/** Number of instances of the DMA module. */
#define DMA_INSTANCE_COUNT (1u)

/* DMA - Peripheral instance base addresses */
/** Peripheral DMA base address */
#define IP_DMA_BASE (0x40008000u)
/** Peripheral DMA base pointer */
#define IP_DMA ((DMA_Type*)IP_DMA_BASE)
/** Array initializer of DMA peripheral base addresses */
#define IP_DMA_BASE_ADDRS                                                                          \
    {                                                                                              \
        IP_DMA_BASE                                                                                \
    }
/** Array initializer of DMA peripheral base pointers */
#define IP_DMA_BASE_PTRS                                                                           \
    {                                                                                              \
        IP_DMA                                                                                     \
    }

/* ----------------------------------------------------------------------------
   -- DMA Register Masks
   ---------------------------------------------------------------------------- */

/*!
 * @addtogroup DMA_Register_Masks DMA Register Masks
 * @{
 */

