rashiqul/S32K1X_Workspace/src/bsp/platform_sdk/RTD/BaseNXP_TS_T40D2M30I0R0/header/S32M24x_DMA.h
#define DMA_EARS_EDREQ_7_MASK (0x80U)
#define DMA_EARS_EDREQ_7_SHIFT (7U)
#define DMA_EARS_EDREQ_7_WIDTH (1U)
#define DMA_EARS_EDREQ_7(x)                                                                        \
    (((uint32_t)(((uint32_t)(x)) << DMA_EARS_EDREQ_7_SHIFT)) & DMA_EARS_EDREQ_7_MASK)

#define DMA_EARS_EDREQ_8_MASK (0x100U)
#define DMA_EARS_EDREQ_8_SHIFT (8U)
#define DMA_EARS_EDREQ_8_WIDTH (1U)
#define DMA_EARS_EDREQ_8(x)                                                                        \
    (((uint32_t)(((uint32_t)(x)) << DMA_EARS_EDREQ_8_SHIFT)) & DMA_EARS_EDREQ_8_MASK)

#define DMA_EARS_EDREQ_9_MASK (0x200U)
#define DMA_EARS_EDREQ_9_SHIFT (9U)
#define DMA_EARS_EDREQ_9_WIDTH (1U)
#define DMA_EARS_EDREQ_9(x)                                                                        \
    (((uint32_t)(((uint32_t)(x)) << DMA_EARS_EDREQ_9_SHIFT)) & DMA_EARS_EDREQ_9_MASK)

#define DMA_EARS_EDREQ_10_MASK (0x400U)
#define DMA_EARS_EDREQ_10_SHIFT (10U)
#define DMA_EARS_EDREQ_10_WIDTH (1U)
#define DMA_EARS_EDREQ_10(x)                                                                       \
    (((uint32_t)(((uint32_t)(x)) << DMA_EARS_EDREQ_10_SHIFT)) & DMA_EARS_EDREQ_10_MASK)

#define DMA_EARS_EDREQ_11_MASK (0x800U)
#define DMA_EARS_EDREQ_11_SHIFT (11U)
#define DMA_EARS_EDREQ_11_WIDTH (1U)
#define DMA_EARS_EDREQ_11(x)                                                                       \
    (((uint32_t)(((uint32_t)(x)) << DMA_EARS_EDREQ_11_SHIFT)) & DMA_EARS_EDREQ_11_MASK)

#define DMA_EARS_EDREQ_12_MASK (0x1000U)
#define DMA_EARS_EDREQ_12_SHIFT (12U)
#define DMA_EARS_EDREQ_12_WIDTH (1U)
#define DMA_EARS_EDREQ_12(x)                                                                       \
    (((uint32_t)(((uint32_t)(x)) << DMA_EARS_EDREQ_12_SHIFT)) & DMA_EARS_EDREQ_12_MASK)

#define DMA_EARS_EDREQ_13_MASK (0x2000U)
#define DMA_EARS_EDREQ_13_SHIFT (13U)
#define DMA_EARS_EDREQ_13_WIDTH (1U)
#define DMA_EARS_EDREQ_13(x)                                                                       \
    (((uint32_t)(((uint32_t)(x)) << DMA_EARS_EDREQ_13_SHIFT)) & DMA_EARS_EDREQ_13_MASK)

#define DMA_EARS_EDREQ_14_MASK (0x4000U)
#define DMA_EARS_EDREQ_14_SHIFT (14U)
#define DMA_EARS_EDREQ_14_WIDTH (1U)
#define DMA_EARS_EDREQ_14(x)                                                                       \
    (((uint32_t)(((uint32_t)(x)) << DMA_EARS_EDREQ_14_SHIFT)) & DMA_EARS_EDREQ_14_MASK)

#define DMA_EARS_EDREQ_15_MASK (0x8000U)
#define DMA_EARS_EDREQ_15_SHIFT (15U)
#define DMA_EARS_EDREQ_15_WIDTH (1U)
#define DMA_EARS_EDREQ_15(x)                                                                       \
    (((uint32_t)(((uint32_t)(x)) << DMA_EARS_EDREQ_15_SHIFT)) & DMA_EARS_EDREQ_15_MASK)
/*! @} */

/*! @name DCHPRI - Channel Priority */
/*! @{ */

#define DMA_DCHPRI_CHPRI_MASK (0xFU)
#define DMA_DCHPRI_CHPRI_SHIFT (0U)
#define DMA_DCHPRI_CHPRI_WIDTH (4U)
#define DMA_DCHPRI_CHPRI(x)                                                                        \
    (((uint8_t)(((uint8_t)(x)) << DMA_DCHPRI_CHPRI_SHIFT)) & DMA_DCHPRI_CHPRI_MASK)

#define DMA_DCHPRI_DPA_MASK (0x40U)
#define DMA_DCHPRI_DPA_SHIFT (6U)
#define DMA_DCHPRI_DPA_WIDTH (1U)
#define DMA_DCHPRI_DPA(x)                                                                          \
    (((uint8_t)(((uint8_t)(x)) << DMA_DCHPRI_DPA_SHIFT)) & DMA_DCHPRI_DPA_MASK)

#define DMA_DCHPRI_ECP_MASK (0x80U)
#define DMA_DCHPRI_ECP_SHIFT (7U)
#define DMA_DCHPRI_ECP_WIDTH (1U)
#define DMA_DCHPRI_ECP(x)                                                                          \
    (((uint8_t)(((uint8_t)(x)) << DMA_DCHPRI_ECP_SHIFT)) & DMA_DCHPRI_ECP_MASK)
/*! @} */

/*! @name TCD_SADDR - TCD Source Address */
/*! @{ */

#define DMA_TCD_SADDR_SADDR_MASK (0xFFFFFFFFU)
#define DMA_TCD_SADDR_SADDR_SHIFT (0U)
#define DMA_TCD_SADDR_SADDR_WIDTH (32U)
#define DMA_TCD_SADDR_SADDR(x)                                                                     \
    (((uint32_t)(((uint32_t)(x)) << DMA_TCD_SADDR_SADDR_SHIFT)) & DMA_TCD_SADDR_SADDR_MASK)
/*! @} */

/*! @name TCD_SOFF - TCD Signed Source Address Offset */
/*! @{ */

#define DMA_TCD_SOFF_SOFF_MASK (0xFFFFU)
#define DMA_TCD_SOFF_SOFF_SHIFT (0U)
#define DMA_TCD_SOFF_SOFF_WIDTH (16U)
#define DMA_TCD_SOFF_SOFF(x)                                                                       \
    (((uint16_t)(((uint16_t)(x)) << DMA_TCD_SOFF_SOFF_SHIFT)) & DMA_TCD_SOFF_SOFF_MASK)
/*! @} */

/*! @name TCD_ATTR - TCD Transfer Attributes */
/*! @{ */

#define DMA_TCD_ATTR_DSIZE_MASK (0x7U)
#define DMA_TCD_ATTR_DSIZE_SHIFT (0U)
#define DMA_TCD_ATTR_DSIZE_WIDTH (3U)
#define DMA_TCD_ATTR_DSIZE(x)                                                                      \
    (((uint16_t)(((uint16_t)(x)) << DMA_TCD_ATTR_DSIZE_SHIFT)) & DMA_TCD_ATTR_DSIZE_MASK)

#define DMA_TCD_ATTR_DMOD_MASK (0xF8U)
#define DMA_TCD_ATTR_DMOD_SHIFT (3U)
#define DMA_TCD_ATTR_DMOD_WIDTH (5U)
#define DMA_TCD_ATTR_DMOD(x)                                                                       \
    (((uint16_t)(((uint16_t)(x)) << DMA_TCD_ATTR_DMOD_SHIFT)) & DMA_TCD_ATTR_DMOD_MASK)

#define DMA_TCD_ATTR_SSIZE_MASK (0x700U)
#define DMA_TCD_ATTR_SSIZE_SHIFT (8U)
#define DMA_TCD_ATTR_SSIZE_WIDTH (3U)
#define DMA_TCD_ATTR_SSIZE(x)                                                                      \
    (((uint16_t)(((uint16_t)(x)) << DMA_TCD_ATTR_SSIZE_SHIFT)) & DMA_TCD_ATTR_SSIZE_MASK)

#define DMA_TCD_ATTR_SMOD_MASK (0xF800U)
#define DMA_TCD_ATTR_SMOD_SHIFT (11U)
#define DMA_TCD_ATTR_SMOD_WIDTH (5U)
#define DMA_TCD_ATTR_SMOD(x)                                                                       \
    (((uint16_t)(((uint16_t)(x)) << DMA_TCD_ATTR_SMOD_SHIFT)) & DMA_TCD_ATTR_SMOD_MASK)
/*! @} */

/*! @name TCD_NBYTES_MLNO - TCD Minor Byte Count (Minor Loop Mapping Disabled) */
/*! @{ */

#define DMA_TCD_NBYTES_MLNO_NBYTES_MASK (0xFFFFFFFFU)
#define DMA_TCD_NBYTES_MLNO_NBYTES_SHIFT (0U)
#define DMA_TCD_NBYTES_MLNO_NBYTES_WIDTH (32U)
#define DMA_TCD_NBYTES_MLNO_NBYTES(x)                                                              \
    (((uint32_t)(((uint32_t)(x)) << DMA_TCD_NBYTES_MLNO_NBYTES_SHIFT)) &                           \
     DMA_TCD_NBYTES_MLNO_NBYTES_MASK)
/*! @} */

