rashiqul/S32K1X_Workspace/src/bsp/platform_sdk/RTD/BaseNXP_TS_T40D2M30I0R0/header/S32M24x_DMA.h
/*! @name TCD_NBYTES_MLOFFNO - TCD Signed Minor Loop Offset (Minor Loop Mapping Enabled and Offset
 * Disabled) */
/*! @{ */

#define DMA_TCD_NBYTES_MLOFFNO_NBYTES_MASK (0x3FFFFFFFU)
#define DMA_TCD_NBYTES_MLOFFNO_NBYTES_SHIFT (0U)
#define DMA_TCD_NBYTES_MLOFFNO_NBYTES_WIDTH (30U)
#define DMA_TCD_NBYTES_MLOFFNO_NBYTES(x)                                                           \
    (((uint32_t)(((uint32_t)(x)) << DMA_TCD_NBYTES_MLOFFNO_NBYTES_SHIFT)) &                        \
     DMA_TCD_NBYTES_MLOFFNO_NBYTES_MASK)

#define DMA_TCD_NBYTES_MLOFFNO_DMLOE_MASK (0x40000000U)
#define DMA_TCD_NBYTES_MLOFFNO_DMLOE_SHIFT (30U)
#define DMA_TCD_NBYTES_MLOFFNO_DMLOE_WIDTH (1U)
#define DMA_TCD_NBYTES_MLOFFNO_DMLOE(x)                                                            \
    (((uint32_t)(((uint32_t)(x)) << DMA_TCD_NBYTES_MLOFFNO_DMLOE_SHIFT)) &                         \
     DMA_TCD_NBYTES_MLOFFNO_DMLOE_MASK)

#define DMA_TCD_NBYTES_MLOFFNO_SMLOE_MASK (0x80000000U)
#define DMA_TCD_NBYTES_MLOFFNO_SMLOE_SHIFT (31U)
#define DMA_TCD_NBYTES_MLOFFNO_SMLOE_WIDTH (1U)
#define DMA_TCD_NBYTES_MLOFFNO_SMLOE(x)                                                            \
    (((uint32_t)(((uint32_t)(x)) << DMA_TCD_NBYTES_MLOFFNO_SMLOE_SHIFT)) &                         \
     DMA_TCD_NBYTES_MLOFFNO_SMLOE_MASK)
/*! @} */

/*! @name TCD_NBYTES_MLOFFYES - TCD Signed Minor Loop Offset (Minor Loop Mapping and Offset Enabled)
 */
/*! @{ */

#define DMA_TCD_NBYTES_MLOFFYES_NBYTES_MASK (0x3FFU)
#define DMA_TCD_NBYTES_MLOFFYES_NBYTES_SHIFT (0U)
#define DMA_TCD_NBYTES_MLOFFYES_NBYTES_WIDTH (10U)
#define DMA_TCD_NBYTES_MLOFFYES_NBYTES(x)                                                          \
    (((uint32_t)(((uint32_t)(x)) << DMA_TCD_NBYTES_MLOFFYES_NBYTES_SHIFT)) &                       \
     DMA_TCD_NBYTES_MLOFFYES_NBYTES_MASK)

#define DMA_TCD_NBYTES_MLOFFYES_MLOFF_MASK (0x3FFFFC00U)
#define DMA_TCD_NBYTES_MLOFFYES_MLOFF_SHIFT (10U)
#define DMA_TCD_NBYTES_MLOFFYES_MLOFF_WIDTH (20U)
#define DMA_TCD_NBYTES_MLOFFYES_MLOFF(x)                                                           \
    (((uint32_t)(((uint32_t)(x)) << DMA_TCD_NBYTES_MLOFFYES_MLOFF_SHIFT)) &                        \
     DMA_TCD_NBYTES_MLOFFYES_MLOFF_MASK)

#define DMA_TCD_NBYTES_MLOFFYES_DMLOE_MASK (0x40000000U)
#define DMA_TCD_NBYTES_MLOFFYES_DMLOE_SHIFT (30U)
#define DMA_TCD_NBYTES_MLOFFYES_DMLOE_WIDTH (1U)
#define DMA_TCD_NBYTES_MLOFFYES_DMLOE(x)                                                           \
    (((uint32_t)(((uint32_t)(x)) << DMA_TCD_NBYTES_MLOFFYES_DMLOE_SHIFT)) &                        \
     DMA_TCD_NBYTES_MLOFFYES_DMLOE_MASK)

#define DMA_TCD_NBYTES_MLOFFYES_SMLOE_MASK (0x80000000U)
#define DMA_TCD_NBYTES_MLOFFYES_SMLOE_SHIFT (31U)
#define DMA_TCD_NBYTES_MLOFFYES_SMLOE_WIDTH (1U)
#define DMA_TCD_NBYTES_MLOFFYES_SMLOE(x)                                                           \
    (((uint32_t)(((uint32_t)(x)) << DMA_TCD_NBYTES_MLOFFYES_SMLOE_SHIFT)) &                        \
     DMA_TCD_NBYTES_MLOFFYES_SMLOE_MASK)
/*! @} */

/*! @name TCD_SLAST - TCD Last Source Address Adjustment */
/*! @{ */

#define DMA_TCD_SLAST_SLAST_MASK (0xFFFFFFFFU)
#define DMA_TCD_SLAST_SLAST_SHIFT (0U)
#define DMA_TCD_SLAST_SLAST_WIDTH (32U)
#define DMA_TCD_SLAST_SLAST(x)                                                                     \
    (((uint32_t)(((uint32_t)(x)) << DMA_TCD_SLAST_SLAST_SHIFT)) & DMA_TCD_SLAST_SLAST_MASK)
/*! @} */

/*! @name TCD_DADDR - TCD Destination Address */
/*! @{ */

#define DMA_TCD_DADDR_DADDR_MASK (0xFFFFFFFFU)
#define DMA_TCD_DADDR_DADDR_SHIFT (0U)
#define DMA_TCD_DADDR_DADDR_WIDTH (32U)
#define DMA_TCD_DADDR_DADDR(x)                                                                     \
    (((uint32_t)(((uint32_t)(x)) << DMA_TCD_DADDR_DADDR_SHIFT)) & DMA_TCD_DADDR_DADDR_MASK)
/*! @} */

/*! @name TCD_DOFF - TCD Signed Destination Address Offset */
/*! @{ */

#define DMA_TCD_DOFF_DOFF_MASK (0xFFFFU)
#define DMA_TCD_DOFF_DOFF_SHIFT (0U)
#define DMA_TCD_DOFF_DOFF_WIDTH (16U)
#define DMA_TCD_DOFF_DOFF(x)                                                                       \
    (((uint16_t)(((uint16_t)(x)) << DMA_TCD_DOFF_DOFF_SHIFT)) & DMA_TCD_DOFF_DOFF_MASK)
/*! @} */

/*! @name TCD_CITER_ELINKNO - TCD Current Minor Loop Link, Major Loop Count (Channel Linking
 * Disabled) */
/*! @{ */

#define DMA_TCD_CITER_ELINKNO_CITER_MASK (0x7FFFU)
#define DMA_TCD_CITER_ELINKNO_CITER_SHIFT (0U)
#define DMA_TCD_CITER_ELINKNO_CITER_WIDTH (15U)
#define DMA_TCD_CITER_ELINKNO_CITER(x)                                                             \
    (((uint16_t)(((uint16_t)(x)) << DMA_TCD_CITER_ELINKNO_CITER_SHIFT)) &                          \
     DMA_TCD_CITER_ELINKNO_CITER_MASK)

#define DMA_TCD_CITER_ELINKNO_ELINK_MASK (0x8000U)
#define DMA_TCD_CITER_ELINKNO_ELINK_SHIFT (15U)
#define DMA_TCD_CITER_ELINKNO_ELINK_WIDTH (1U)
#define DMA_TCD_CITER_ELINKNO_ELINK(x)                                                             \
    (((uint16_t)(((uint16_t)(x)) << DMA_TCD_CITER_ELINKNO_ELINK_SHIFT)) &                          \
     DMA_TCD_CITER_ELINKNO_ELINK_MASK)
/*! @} */

/*! @name TCD_CITER_ELINKYES - TCD Current Minor Loop Link, Major Loop Count (Channel Linking
 * Enabled) */
/*! @{ */

#define DMA_TCD_CITER_ELINKYES_CITER_MASK (0x1FFU)
#define DMA_TCD_CITER_ELINKYES_CITER_SHIFT (0U)
#define DMA_TCD_CITER_ELINKYES_CITER_WIDTH (9U)
#define DMA_TCD_CITER_ELINKYES_CITER(x)                                                            \
    (((uint16_t)(((uint16_t)(x)) << DMA_TCD_CITER_ELINKYES_CITER_SHIFT)) &                         \
     DMA_TCD_CITER_ELINKYES_CITER_MASK)

#define DMA_TCD_CITER_ELINKYES_LINKCH_MASK (0x1E00U)
#define DMA_TCD_CITER_ELINKYES_LINKCH_SHIFT (9U)
#define DMA_TCD_CITER_ELINKYES_LINKCH_WIDTH (4U)
#define DMA_TCD_CITER_ELINKYES_LINKCH(x)                                                           \
    (((uint16_t)(((uint16_t)(x)) << DMA_TCD_CITER_ELINKYES_LINKCH_SHIFT)) &                        \
     DMA_TCD_CITER_ELINKYES_LINKCH_MASK)

#define DMA_TCD_CITER_ELINKYES_ELINK_MASK (0x8000U)
#define DMA_TCD_CITER_ELINKYES_ELINK_SHIFT (15U)
#define DMA_TCD_CITER_ELINKYES_ELINK_WIDTH (1U)
#define DMA_TCD_CITER_ELINKYES_ELINK(x)                                                            \
    (((uint16_t)(((uint16_t)(x)) << DMA_TCD_CITER_ELINKYES_ELINK_SHIFT)) &                         \
     DMA_TCD_CITER_ELINKYES_ELINK_MASK)
/*! @} */

/*! @name TCD_DLASTSGA - TCD Last Destination Address Adjustment/Scatter Gather Address */
/*! @{ */

#define DMA_TCD_DLASTSGA_DLASTSGA_MASK (0xFFFFFFFFU)
#define DMA_TCD_DLASTSGA_DLASTSGA_SHIFT (0U)
#define DMA_TCD_DLASTSGA_DLASTSGA_WIDTH (32U)
#define DMA_TCD_DLASTSGA_DLASTSGA(x)                                                               \
    (((uint32_t)(((uint32_t)(x)) << DMA_TCD_DLASTSGA_DLASTSGA_SHIFT)) &                            \
     DMA_TCD_DLASTSGA_DLASTSGA_MASK)
/*! @} */

