rashiqul/S32K1X_Workspace/src/bsp/platform_sdk/RTD/BaseNXP_TS_T40D2M30I0R0/header/S32M24x_DMA.h
/*! @name TCD_CSR - TCD Control and Status */
/*! @{ */

#define DMA_TCD_CSR_START_MASK (0x1U)
#define DMA_TCD_CSR_START_SHIFT (0U)
#define DMA_TCD_CSR_START_WIDTH (1U)
#define DMA_TCD_CSR_START(x)                                                                       \
    (((uint16_t)(((uint16_t)(x)) << DMA_TCD_CSR_START_SHIFT)) & DMA_TCD_CSR_START_MASK)

#define DMA_TCD_CSR_INTMAJOR_MASK (0x2U)
#define DMA_TCD_CSR_INTMAJOR_SHIFT (1U)
#define DMA_TCD_CSR_INTMAJOR_WIDTH (1U)
#define DMA_TCD_CSR_INTMAJOR(x)                                                                    \
    (((uint16_t)(((uint16_t)(x)) << DMA_TCD_CSR_INTMAJOR_SHIFT)) & DMA_TCD_CSR_INTMAJOR_MASK)

#define DMA_TCD_CSR_INTHALF_MASK (0x4U)
#define DMA_TCD_CSR_INTHALF_SHIFT (2U)
#define DMA_TCD_CSR_INTHALF_WIDTH (1U)
#define DMA_TCD_CSR_INTHALF(x)                                                                     \
    (((uint16_t)(((uint16_t)(x)) << DMA_TCD_CSR_INTHALF_SHIFT)) & DMA_TCD_CSR_INTHALF_MASK)

#define DMA_TCD_CSR_DREQ_MASK (0x8U)
#define DMA_TCD_CSR_DREQ_SHIFT (3U)
#define DMA_TCD_CSR_DREQ_WIDTH (1U)
#define DMA_TCD_CSR_DREQ(x)                                                                        \
    (((uint16_t)(((uint16_t)(x)) << DMA_TCD_CSR_DREQ_SHIFT)) & DMA_TCD_CSR_DREQ_MASK)

#define DMA_TCD_CSR_ESG_MASK (0x10U)
#define DMA_TCD_CSR_ESG_SHIFT (4U)
#define DMA_TCD_CSR_ESG_WIDTH (1U)
#define DMA_TCD_CSR_ESG(x)                                                                         \
    (((uint16_t)(((uint16_t)(x)) << DMA_TCD_CSR_ESG_SHIFT)) & DMA_TCD_CSR_ESG_MASK)

#define DMA_TCD_CSR_MAJORELINK_MASK (0x20U)
#define DMA_TCD_CSR_MAJORELINK_SHIFT (5U)
#define DMA_TCD_CSR_MAJORELINK_WIDTH (1U)
#define DMA_TCD_CSR_MAJORELINK(x)                                                                  \
    (((uint16_t)(((uint16_t)(x)) << DMA_TCD_CSR_MAJORELINK_SHIFT)) & DMA_TCD_CSR_MAJORELINK_MASK)

#define DMA_TCD_CSR_ACTIVE_MASK (0x40U)
#define DMA_TCD_CSR_ACTIVE_SHIFT (6U)
#define DMA_TCD_CSR_ACTIVE_WIDTH (1U)
#define DMA_TCD_CSR_ACTIVE(x)                                                                      \
    (((uint16_t)(((uint16_t)(x)) << DMA_TCD_CSR_ACTIVE_SHIFT)) & DMA_TCD_CSR_ACTIVE_MASK)

#define DMA_TCD_CSR_DONE_MASK (0x80U)
#define DMA_TCD_CSR_DONE_SHIFT (7U)
#define DMA_TCD_CSR_DONE_WIDTH (1U)
#define DMA_TCD_CSR_DONE(x)                                                                        \
    (((uint16_t)(((uint16_t)(x)) << DMA_TCD_CSR_DONE_SHIFT)) & DMA_TCD_CSR_DONE_MASK)

#define DMA_TCD_CSR_MAJORLINKCH_MASK (0xF00U)
#define DMA_TCD_CSR_MAJORLINKCH_SHIFT (8U)
#define DMA_TCD_CSR_MAJORLINKCH_WIDTH (4U)
#define DMA_TCD_CSR_MAJORLINKCH(x)                                                                 \
    (((uint16_t)(((uint16_t)(x)) << DMA_TCD_CSR_MAJORLINKCH_SHIFT)) & DMA_TCD_CSR_MAJORLINKCH_MASK)

#define DMA_TCD_CSR_BWC_MASK (0xC000U)
#define DMA_TCD_CSR_BWC_SHIFT (14U)
#define DMA_TCD_CSR_BWC_WIDTH (2U)
#define DMA_TCD_CSR_BWC(x)                                                                         \
    (((uint16_t)(((uint16_t)(x)) << DMA_TCD_CSR_BWC_SHIFT)) & DMA_TCD_CSR_BWC_MASK)
/*! @} */

/*! @name TCD_BITER_ELINKNO - TCD Beginning Minor Loop Link, Major Loop Count (Channel Linking
 * Disabled) */
/*! @{ */

#define DMA_TCD_BITER_ELINKNO_BITER_MASK (0x7FFFU)
#define DMA_TCD_BITER_ELINKNO_BITER_SHIFT (0U)
#define DMA_TCD_BITER_ELINKNO_BITER_WIDTH (15U)
#define DMA_TCD_BITER_ELINKNO_BITER(x)                                                             \
    (((uint16_t)(((uint16_t)(x)) << DMA_TCD_BITER_ELINKNO_BITER_SHIFT)) &                          \
     DMA_TCD_BITER_ELINKNO_BITER_MASK)

#define DMA_TCD_BITER_ELINKNO_ELINK_MASK (0x8000U)
#define DMA_TCD_BITER_ELINKNO_ELINK_SHIFT (15U)
#define DMA_TCD_BITER_ELINKNO_ELINK_WIDTH (1U)
#define DMA_TCD_BITER_ELINKNO_ELINK(x)                                                             \
    (((uint16_t)(((uint16_t)(x)) << DMA_TCD_BITER_ELINKNO_ELINK_SHIFT)) &                          \
     DMA_TCD_BITER_ELINKNO_ELINK_MASK)
/*! @} */

/*! @name TCD_BITER_ELINKYES - TCD Beginning Minor Loop Link, Major Loop Count (Channel Linking
 * Enabled) */
/*! @{ */

#define DMA_TCD_BITER_ELINKYES_BITER_MASK (0x1FFU)
#define DMA_TCD_BITER_ELINKYES_BITER_SHIFT (0U)
#define DMA_TCD_BITER_ELINKYES_BITER_WIDTH (9U)
#define DMA_TCD_BITER_ELINKYES_BITER(x)                                                            \
    (((uint16_t)(((uint16_t)(x)) << DMA_TCD_BITER_ELINKYES_BITER_SHIFT)) &                         \
     DMA_TCD_BITER_ELINKYES_BITER_MASK)

#define DMA_TCD_BITER_ELINKYES_LINKCH_MASK (0x1E00U)
#define DMA_TCD_BITER_ELINKYES_LINKCH_SHIFT (9U)
#define DMA_TCD_BITER_ELINKYES_LINKCH_WIDTH (4U)
#define DMA_TCD_BITER_ELINKYES_LINKCH(x)                                                           \
    (((uint16_t)(((uint16_t)(x)) << DMA_TCD_BITER_ELINKYES_LINKCH_SHIFT)) &                        \
     DMA_TCD_BITER_ELINKYES_LINKCH_MASK)

#define DMA_TCD_BITER_ELINKYES_ELINK_MASK (0x8000U)
#define DMA_TCD_BITER_ELINKYES_ELINK_SHIFT (15U)
#define DMA_TCD_BITER_ELINKYES_ELINK_WIDTH (1U)
#define DMA_TCD_BITER_ELINKYES_ELINK(x)                                                            \
    (((uint16_t)(((uint16_t)(x)) << DMA_TCD_BITER_ELINKYES_ELINK_SHIFT)) &                         \
     DMA_TCD_BITER_ELINKYES_ELINK_MASK)
/*! @} */

/*!
 * @}
 */ /* end of group DMA_Register_Masks */

/*!
 * @}
 */ /* end of group DMA_Peripheral_Access_Layer */

#endif /* #if !defined(S32M24x_DMA_H_) */
